Revit 2027 API
DocumentSet.Contains Method
Tests for the existence of an item within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	Document item
)
Public Overridable Function Contains (
	item As Document
) As Boolean
public:
virtual bool Contains(
	Document^ item
)
abstract Contains :
        item : Document -> bool
override Contains :
        item : Document -> bool
Parameters
item Document
The item to be searched for.
Return Value
Boolean
The Contains method returns True if the item is within the set, otherwise False.
See Also
Reference
DocumentSet Class
Autodesk.Revit.DB Namespace